RIET/src/Documents/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Job</name>
  <posting>Deny</posting>
  <attributes>
    <name>Period</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTLNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>LocationName</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>CANumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Well</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>AmountInContractCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyOfContract</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseСurrencyTotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SIRNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accountant</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>SiebelOrder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CommentsForRevenueAccrual</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OFSStoreCaddy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JobDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceReimbursableAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceReimbursable</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductReimbursableAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductReimbursable</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DCSPartOfRevenue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Engineer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/InformationRegisters/JobLogAccessRights/JobLogAccessRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>JobLogAccessRights</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>УДАЛИТЬSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </resources>
  <resources>
    <name>LocationName</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </resources>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/Job/ManagerModule.bsl
Процедура УстановитьПараметрUserSegments(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.UserSegments = ПолучитьSegmentsТекущегоПользователя();	
	УстановленныеПараметры.Добавить("UserSegments");
	
КонецПроцедуры 

Функция ПолучитьSegmentsТекущегоПользователя() Экспорт
	
	ТЗ = РегистрыСведений.JobLogAccessRights.СрезПоследних(ТекущаяДата(), Новый Структура("User", ПараметрыСеанса.ТекущийПользователь));
	     	
	Если ТЗ.Количество() > 0 Тогда 
		МассивСегментов = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(ТЗ, "Segment");
	иначе 
		МассивСегментов = Новый Массив;
		МассивСегментов.Добавить(Справочники.Сегменты.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(МассивСегментов);
	
КонецФункции

Процедура ЗаполнитьSubSegmentИСчетаLawsonПоУмолчаниюДляСегмента(Объект) Экспорт 
	
	ТекSegment = СокрЛП(Строка(Объект.Segment));
	
	Объект.ServiceReimbursableAccount = ПланыСчетов.Lawson.НайтиПоКоду("429999");
	Объект.ProductReimbursableAccount = ПланыСчетов.Lawson.НайтиПоКоду("459999");
		
	Если ТекSegment = "ALS" Тогда 
		
		Объект.ServiceAccount = ПланыСчетов.Lawson.НайтиПоКоду("425009");
		Объект.ProductAccount = ПланыСчетов.Lawson.НайтиПоКоду("455009");
		Объект.SubSegment = Справочники.Сегменты.НайтиПоКоду("ATL");
		
	ИначеЕсли ТекSegment = "WSV" Тогда 
		
		ТекSubSegment = СокрЛП(Строка(Объект.SubSegment));
		
		Если ТекSubSegment = "WPS" Тогда 
			
			Account = ПланыСчетов.Lawson.НайтиПоКоду("410002");
			Объект.ServiceAccount = Account;
			Объект.ProductAccount = Account;
			
		ИначеЕсли ТекSubSegment = "WCS" Тогда 
			
			Account = ПланыСчетов.Lawson.НайтиПоКоду("409001");
			Объект.ServiceAccount = Account;
			Объект.ProductAccount = Account;
			
		КонецЕсли;
	
	ИначеЕсли ТекSegment = "WIS" Тогда 
		
		Account = ПланыСчетов.Lawson.НайтиПоКоду("411001");
		Объект.ServiceAccount = Account;
		Объект.ProductAccount = Account;
		
	иначе
		
		Объект.ServiceReimbursableAccount = Неопределено;
		Объект.ProductReimbursableAccount = Неопределено;
		Объект.ServiceAccount = Неопределено;
		Объект.ProductAccount = Неопределено;
		
		Объект.ServiceReimbursable = 0;
		Объект.ProductReimbursable = 0;
		Объект.Service = 0;
		Объект.Product = 0;
		    	
	КонецЕсли;
	
	Если ТекSegment = "DBM" Тогда 
		Объект.SubSegment = Справочники.Сегменты.НайтиПоКоду("ANA");
	ИначеЕсли ТекSegment = "REW" Тогда 
		Объект.SubSegment = Справочники.Сегменты.НайтиПоКоду("WL");
	КонецЕсли;

КонецПроцедуры
